p2p-bench/results/2026-06-16_5060ti-16gb_2cards_gen3-x4_p2p-sweep-c1-2-4-8/scenarios/p2p_off-c2/run_3.stdout.txt
WARNING 06-16 22:01:27 [cuda.py:838] Detected different devices in the system: NVIDIA GeForce RTX 5070, NVIDIA GeForce RTX 5060 Ti, NVIDIA GeForce RTX 5060 Ti. Please make sure to set `CUDA_DEVICE_ORDER=PCI_BUS_ID` to avoid unexpected behavior.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7d5bb1d8b240>, trust_remote_code=False, seed=1234, num_prompts=32, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=1024, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='vllm', base_url='http://127.0.0.1:8081', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=2, model='p2p_off-c2', input_len=None, output_len=None, tokenizer='/data/models/qwen3.6-27b-text-nvfp4-mtp', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=8, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='results/run1/scenarios/p2p_off-c2', result_filename='run_3.json', ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-8a282a8c-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 06-16 22:01:33 [utils.py:90] Sampling input_len from [1024, 1024] and output_len from [1024, 1024]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 8 requests...
Warmup run completed.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 2
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     32        
Failed requests:                         0         
Maximum request concurrency:             2         
Benchmark duration (s):                  332.41    
Total input tokens:                      32768     
Total generated tokens:                  32768     
Request throughput (req/s):              0.10      
Output token throughput (tok/s):         98.58     
Peak output token throughput (tok/s):    38.00     
Peak concurrent requests:                3.00      
Total token throughput (tok/s):          197.15    
---------------Time to First Token----------------
Mean TTFT (ms):                          1063.80   
Median TTFT (ms):                        1016.75   
P50 TTFT (ms):                           1016.75   
P90 TTFT (ms):                           1022.40   
P99 TTFT (ms):                           1797.44   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          18.95     
Median TPOT (ms):                        18.22     
P50 TPOT (ms):                           18.22     
P90 TPOT (ms):                           22.61     
P99 TPOT (ms):                           32.68     
---------------Inter-token Latency----------------
Mean ITL (ms):                           55.32     
Median ITL (ms):                         53.09     
P50 ITL (ms):                            53.09     
P90 ITL (ms):                            53.41     
P99 ITL (ms):                            53.96     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          20454.53  
Median E2EL (ms):                        20049.92  
P50 E2EL (ms):                           20049.92  
P90 E2EL (ms):                           24147.73  
P99 E2EL (ms):                           34455.96  
==================================================


  0%|          | 0/8 [00:00<?, ?it/s]
 12%|█▎        | 1/8 [00:15<01:50, 15.77s/it]
 25%|██▌       | 2/8 [00:20<00:56,  9.35s/it]
 38%|███▊      | 3/8 [00:32<00:51, 10.36s/it]
 50%|█████     | 4/8 [00:41<00:39,  9.94s/it]
 62%|██████▎   | 5/8 [00:48<00:26,  8.75s/it]
 75%|███████▌  | 6/8 [00:57<00:18,  9.04s/it]
 88%|████████▊ | 7/8 [01:04<00:08,  8.17s/it]
100%|██████████| 8/8 [01:24<00:00, 12.01s/it]
100%|██████████| 8/8 [01:24<00:00, 10.54s/it]

  0%|          | 0/32 [00:00<?, ?it/s]
  3%|▎         | 1/32 [00:15<08:05, 15.66s/it]
  6%|▋         | 2/32 [00:20<04:31,  9.06s/it]
  9%|▉         | 3/32 [00:38<06:24, 13.28s/it]
 12%|█▎        | 4/32 [00:41<04:23,  9.42s/it]
 16%|█▌        | 5/32 [00:57<05:11, 11.53s/it]
 19%|█▉        | 6/32 [01:03<04:12,  9.71s/it]
 22%|██▏       | 7/32 [01:19<04:54, 11.77s/it]
 25%|██▌       | 8/32 [01:34<05:10, 12.95s/it]
 28%|██▊       | 9/32 [01:39<04:00, 10.47s/it]
 31%|███▏      | 10/32 [01:54<04:16, 11.65s/it]
 34%|███▍      | 11/32 [02:01<03:35, 10.28s/it]
 38%|███▊      | 12/32 [02:14<03:41, 11.05s/it]
 41%|████      | 13/32 [02:28<03:49, 12.09s/it]
 44%|████▍     | 14/32 [02:34<03:05, 10.32s/it]
 47%|████▋     | 15/32 [02:50<03:22, 11.92s/it]
 50%|█████     | 16/32 [02:56<02:41, 10.10s/it]
 53%|█████▎    | 17/32 [03:13<03:01, 12.10s/it]
 56%|█████▋    | 18/32 [03:15<02:09,  9.24s/it]
 59%|█████▉    | 19/32 [03:29<02:16, 10.52s/it]
 62%|██████▎   | 20/32 [03:39<02:04, 10.34s/it]
 66%|██████▌   | 21/32 [03:46<01:42,  9.33s/it]
 69%|██████▉   | 22/32 [03:55<01:34,  9.42s/it]
 72%|███████▏  | 23/32 [04:04<01:23,  9.30s/it]
 75%|███████▌  | 24/32 [04:14<01:15,  9.41s/it]
 78%|███████▊  | 25/32 [04:22<01:03,  9.05s/it]
 81%|████████▏ | 26/32 [04:33<00:57,  9.58s/it]
 84%|████████▍ | 27/32 [04:45<00:51, 10.23s/it]
 88%|████████▊ | 28/32 [04:51<00:36,  9.21s/it]
 91%|█████████ | 29/32 [05:06<00:32, 10.84s/it]
 94%|█████████▍| 30/32 [05:08<00:16,  8.05s/it]
 97%|█████████▋| 31/32 [05:22<00:09,  9.89s/it]
100%|██████████| 32/32 [05:32<00:00,  9.94s/it]
100%|██████████| 32/32 [05:32<00:00, 10.39s/it]